In [3]:
from IPython.display import Image
import pandas as pd
import numpy as np
#Add code to set current working directory

![](img/Start_withdata.png)

![](img/pandas_datatypes.png)

In [5]:
a =  pd.DataFrame([[1,"BBS",33,1259+5j],[2,"Bangalore",27,6578-8j]],index=["Me","My_Bro"], columns= ["Sl No.", "Location", "Age", "Latitude"])
print(a)

        Sl No.   Location  Age   Latitude
Me           1        BBS   33  (1259+5j)
My_Bro       2  Bangalore   27  (6578-8j)

# Summarize data

# Get First Few Records of dataset

In [12]:
a.head()

        Sl No.   Location  Age   Latitude
Me           1        BBS   33  (1259+5j)
My_Bro       2  Bangalore   27  (6578-8j)

# Get last Few Recorss of dataset

In [14]:
a.tail()

        Sl No.   Location  Age   Latitude
Me           1        BBS   33  (1259+5j)
My_Bro       2  Bangalore   27  (6578-8j)

# Let's see how many records and features we have in our dataset

In [18]:
a.shape

(2, 4)

# Get data types of each features

In [6]:
a.dtypes

Sl No.           int64
Location        object
Age              int64
Latitude    complex128
dtype: object

# Correct the datatypes of features

![](img\modify_datatypes.png)

# Get information about missig value count

In [7]:
a.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, Me to My_Bro
Data columns (total 4 columns):
Sl No.      2 non-null int64
Location    2 non-null object
Age         2 non-null int64
Latitude    2 non-null complex128
dtypes: complex128(1), int64(2), object(1)
memory usage: 96.0+ bytes

# Let's quantify (In Percentage) the amount of missing values of all features

In [20]:
a.isnull().sum()*100/a.shape[0] #shape[0] contains no. of records

Sl No.      0.0
Location    0.0
Age         0.0
Latitude    0.0
dtype: float64

# Get Summary statistics for Numeric features only

In [8]:
a.describe()

         Sl No.        Age            Latitude
count  2.000000   2.000000              (2+0j)
mean   1.500000  30.000000       (3918.5-1.5j)
std    0.707107   4.242641  (3761.11220253+0j)
min    1.000000  27.000000           (1259+5j)
25%    1.250000  28.500000     (2588.75+1.75j)
50%    1.500000  30.000000       (3918.5-1.5j)
75%    1.750000  31.500000     (5248.25-4.75j)
max    2.000000  33.000000           (6578-8j)

# Get Summary statistics for Categoric features only

In [9]:
a.describe(include=[np.object])

       Location
count         2
unique        2
top         BBS
freq          1

# Get Summary statistics for both Categoric and Numeric features

In [11]:
a.describe(include='all')

          Sl No. Location        Age            Latitude
count   2.000000        2   2.000000              (2+0j)
unique       NaN        2        NaN                 NaN
top          NaN      BBS        NaN                 NaN
freq         NaN        1        NaN                 NaN
mean    1.500000      NaN  30.000000       (3918.5-1.5j)
std     0.707107      NaN   4.242641  (3761.11220253+0j)
min     1.000000      NaN  27.000000           (1259+5j)
25%     1.250000      NaN  28.500000     (2588.75+1.75j)
50%     1.500000      NaN  30.000000       (3918.5-1.5j)
75%     1.750000      NaN  31.500000     (5248.25-4.75j)
max     2.000000      NaN  33.000000           (6578-8j)

__Unique__: No. of distinct objects in the column

__Top__   : Most frequently occurring object/value in attribute

__Freq__  : No. of times the “TOP Object/Most Frequently Object ” has appeared in the attribute